client/results/rq2/h1/stresstest/client_128/summary.txt
starting benchmark...
spawning thread #0: 64 total client(s). 25000 total requests
spawning thread #1: 64 total client(s). 25000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: http/1.1
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 11.50s, 4348.19 req/s, 19.06MB/s
requests: 50000 total, 50000 started, 50000 done, 50000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 50000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 219.20MB (229850000) total, 6.44MB (6750000) headers (space savings 0.00%), 210.91MB (221150000) data
                     min         max         mean         sd        +/- sd
time for request:      412us    209.15ms     28.62ms     19.38ms    83.65%
time for connect:    14.06ms     65.14ms     38.16ms     13.16ms    64.84%
time to 1st byte:    58.03ms    144.67ms     94.17ms     21.54ms    66.41%
req/s           :      33.98       39.57       34.83        0.83    85.16%